from http.client import HTTPSConnection
from json import dumps, loads
import discord
from discord.ext import commands
import json

TOKEN = ''

dlya_kanalov = {
    "948948056706015262": [[1,2],[2,1],[3,4],[4,3],[5,6],[7,8],[7],[8],[9],[10],[11],[12],[13],[14],[15],[16],[17],[18],[19],[20]],
    "948948114172162078": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
    "1068817054523723797": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
    "948948180224061500": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
    "948948501520318464": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
    "948948641668800512": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
    "948946829104545842": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
    "948947037838278696": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
    "948947087880511539": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
    "1068818229079846952": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
    "948947233527701555": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
    "948947462666731611": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
    "952926815461212180": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
    "1068822618049888311": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
    "1068822719929528380": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
    "1068822821091942400 ": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
    "952927342391615618": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]] ,
    "952927440299249724": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
    "952927518372016128": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
    "952927556389208155": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
    "952927758684667904": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
    "952927977409224715": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
    "952928290966994984": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
    "952928386035118091": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
    "952928742227972096": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
    "952928787597770805": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
    "952929008364961834": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
    "952929078720208896": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
    "952928846527741962": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
    "952941357264150548": [[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
}
intents = discord.Intents.all()
intents.messages = True

bot = commands.Bot(command_prefix='!', intents=intents)
API_TOKEN = 'cf49c183-d3a3-4243-8b77-ccc4a3c8f4e5'

# Параметры запроса

@bot.event
async def on_ready():
    print(f'Бот {bot.user.name} запущен')


@bot.command(name='кубик')
async def roll(ctx):
    request_data = {
        'jsonrpc': '2.0',
        'method': 'generateIntegers',
        'params': {
            'apiKey': API_TOKEN,
            'min': 0,
            'max': 19,
            'n': 1,
        },
        'id': 1,
    }
    encoded_data = dumps(request_data)
    headers = {'Content-Type': 'application/json-rpc'}
    connection = HTTPSConnection('api.random.org')
    connection.request('GET', '/json-rpc/1/invoke', encoded_data, headers)
    response = connection.getresponse()
    response_data = loads(response.read().decode())
    channel_id = ctx.channel.id
    if 'result' in response_data and 'random' in response_data['result']:
        cube = (response_data['result']['random']['data'][0])
    else:
        print("Ошибка при получении данных")
    print(f'значение на кубе {cube}')
    location = dlya_kanalov[str(channel_id)]
    if len(location[cube]) > 1:
        request_data['params']['min'] = 0
        request_data['params']['max'] = len(location[cube]) - 1
        encoded_data = json.dumps(request_data)
        connection.request('GET', '/json-rpc/1/invoke', encoded_data, headers)
        response = connection.getresponse()
        response_data = json.loads(response.read().decode())
        if 'result' in response_data and 'random' in response_data['result']:
            drop = response_data['result']['random']['data'][0]
            print(f'дроп {drop}')
        else:
            print("Ошибка при получении данных")
    else:
        drop = 0
        print(f'дроп {drop}')
    await ctx.send(f'Результат кубика: {cube + 1}')
    match cube:
        case 0:
            await ctx.send(f'Похоже вам крупно не повезло...\n')
            await ctx.send(f'Встреча с врагом! Вам противостоит: {location[cube][drop]}')
        case 1:
            await ctx.send(f'Вы слышите как что-то шевелится позади вас...\n')
            await ctx.send(f'Встреча с врагом! Вам противостоит: {location[cube][drop]}')
        case 2:
            await ctx.send(f'Вы слышите как что-то шевелится позади вас...\n')
            await ctx.send(f'Встреча с врагом! Вам противостоит: {location[cube][drop]}')
        case 3:
            await ctx.send(f'Вы слышите как что-то шевелится позади вас...\n')
            await ctx.send(f'Встреча с врагом! Вам противостоит: {location[cube][drop]}')
        case 4:
            await ctx.send(f'Вы слышите как что-то шевелится позади вас...\n')
            await ctx.send(f'Встреча с врагом! Вам противостоит: {location[cube][drop]}')
        case 5:
            await ctx.send(f'Вы слышите как что-то шевелится позади вас...\n')
            await ctx.send(f'Встреча с врагом! Вам противостоит: {location[cube][drop]}')
        case 6:
            await ctx.send(f'Ничего ценного найти не удалось.\n')
            await ctx.send(f'Всё что вы смогли откопать это: {location[cube][drop]}')
        case 7:
            await ctx.send(f'Ничего ценного найти не удалось.\n')
            await ctx.send(f'Всё что вы смогли откопать это: {location[cube][drop]}')
        case 8:
            await ctx.send(f'Ничего ценного найти не удалось.\n')
            await ctx.send(f'Всё что вы смогли откопать это: {location[cube][drop]}')
        case 9:
            await ctx.send(f'Ничего ценного найти не удалось.\n')
            await ctx.send(f'Всё что вы смогли откопать это: {location[cube][drop]}')
        case 10:
            await ctx.send(f'Порывшись там и тут вам удаётся достать {location[cube][drop]}')
        case 11:
            await ctx.send(f'Порывшись там и тут вам удаётся достать {location[cube][drop]}')
        case 12:
            await ctx.send(f'Порывшись там и тут вам удаётся достать {location[cube][drop]}')
        case 13:
            await ctx.send(f'Порывшись там и тут вам удаётся достать {location[cube][drop]}')
        case 14:
            await ctx.send(f'Порывшись там и тут вам удаётся достать {location[cube][drop]}')
        case 15:
            await ctx.send(f'Поиски оказались на редкость удачными! Уже собираясь уходить, '
                           f'ваш взгляд сользит по странному месту. Рассматривая его пристальнее вы находите {location[cube][drop]}!')
        case 16:
            await ctx.send(f'Поиски оказались на редкость удачными! Уже собираясь уходить, '
                           f'ваш взгляд сользит по странному месту. Рассматривая его пристальнее вы находите {location[cube][drop]}!')
        case 17:
            await ctx.send(f'Поиски оказались на редкость удачными! Уже собираясь уходить, '
                           f'ваш взгляд сользит по странному месту. Рассматривая его пристальнее вы находите {location[cube][drop]}!')
        case 18:
            await ctx.send(f'Поиски оказались на редкость удачными! Уже собираясь уходить, '
                           f'ваш взгляд сользит по странному месту. Рассматривая его пристальнее вы находите {location[cube][drop]}!')
        case 19:
            await ctx.send(f'Похоже, что вам крупно повезло. Внимательно обыскав место вы находите:\n')
            await ctx.send(f'{location[cube][drop]}!')
bot.run(TOKEN)
